[
  {
    "section": "Многоагентная система",
    "text": "Мы активно работаем над внедрением многоагентной системы в Kodik и планируем подготовить её к версии 2.0.0. Система управления многоагентной средой Kodik переведет IDE с файлово-ориентированной структуры на среду, ориентированную на результат, где несколько агентов ИИ могут одновременно работать над независимыми или параллельными задачами. В основе этой системы лежит модель Composer, архитектура смешанных экспертов (MoE), специально обученная для разработки программного обеспечения. Чтобы предотвратить взаимное влияние этих агентов друг на друга или на активную работу пользователя, Kodik будет использовать Git Worktrees, которая создает изолированные копии кодовой базы для до восьми агентов, работающих параллельно. Это позволяет создавать мощные рабочие процессы, такие как подход «Лучший из N», когда один и тот же запрос отправляется нескольким моделям одновременно, чтобы вы могли сравнить их логику и применить наиболее эффективное решение, или многоаспектное выполнение задач, когда один агент рефакторит бэкенд-утилиту, а другой генерирует модульные тесты в фоновом режиме. Система также будет использовать специализированных субагентов для обработки ресурсоемких операций, таких как исследование кодовой базы, тестирование в браузере и анализ логов терминала, в отдельных контекстных окнах. Помимо ручной оркестровки, API фоновых агентов Kodik позволит осуществлять программное управление, позволяя автономным агентам запускать друг друга через веб-хуки для обработки длительных асинхронных задач."
  },
  {
    "section": "Поддерживаемые AI модели",
    "text": "Kodik поддерживает широкий спектр AI моделей для различных задач: Google Gemini 3 Flash Preview — быстрая и эффективная модель для агентных сценариев, многошаговых диалогов и помощи в кодинге. GLM 4.5 Full — полнофункциональная модель GLM с кэшированием и фиксированным провайдером. GLM 4.5 Air — лёгкая и быстрая версия GLM для высокоскоростных задач. GLM 4.6 — актуальная версия GLM с расширенными возможностями. GLM 4.7 — модель GLM 4.7 с оптимизированным кэшированием. GLM-4.6V Vision — мультимодальная модель для точного визуального анализа изображений, документов и сложных макетов с поддержкой до 128K токенов. DeepSeek V3.1 — продвинутая модель для логического мышления и программирования. DeepSeek V3.2 — новейшая версия DeepSeek с улучшенными способностями к рассуждению. Kimi K2 0905 — модель Kimi K2 с поддержкой длинного контекста. Kimi K2.5 — встроенная мультимодальная модель Moonshot AI с передовыми возможностями визуального кодирования и парадигмой самоуправляемого роя агентов. Llama 3.1 Nemotron Ultra 253B — оптимизированная NVIDIA версия модели Llama с повышенной производительностью. Minimax M2 — эффективная двуязычная модель для китайского и английского языков. Kimi K2 Thinking — модель Kimi K2 с продвинутыми возможностями рассуждения. Llama 4 Maverick — инструкционно обученная версия Meta Llama 4 Maverick. Qwen3 14B — быстрая и эффективная модель для общих задач. Qwen3 Coder Plus — специализированная модель для программирования с расширенным контекстом."
  },
  {
    "section": "Kodik Browser - визуальный редактор",
    "text": "Вторая функциональность — это визуальный редактор Kodik Browser, представляющий собой среду проектирования на основе ИИ, интегрированную непосредственно в IDE Kodik, которая устраняет разрыв между визуальным дизайном и производственным кодом, позволяя манипулировать элементами пользовательского интерфейса в работающем приложении и автоматически синхронизировать эти изменения с исходными файлами. Открыв локально запущенный проект во встроенном браузере Kodik и активировав режим проектирования, вы можете использовать функцию перетаскивания для изменения структуры DOM, визуальные ползунки и инструменты выбора для настройки свойств CSS, таких как типографика и отступы, или щелкать по определенным элементам, чтобы получить подсказки на естественном языке для выполнения ИИ. Для современных фреймворков, таких как React, редактор даже будет отображать свойства и состояния компонентов непосредственно в боковой панели, что позволит вам тестировать различные варианты пользовательского интерфейса без ручного кодирования. Как только вы будете удовлетворены этими визуальными настройками, нажатие кнопки «Применить» запустит агента ИИ для анализа изменений и перезаписи базовых файлов проекта, гарантируя соблюдение токенов дизайна и существующих системных ограничений."
  },
  {
    "section": "Режим Debug",
    "text": "Мы активно работаем над внедрением Режима Debug в Kodik и планируем подготовить её к версии 2.0.0. Режим Debug — в Kodik ИИ превратится из творческого помощника в детектива, работающего в режиме реального времени и отдающего приоритет эмпирическим данным, а не догадкам, для решения сложных программных ошибок. В отличие от стандартных чатов, которые выдвигают гипотезы об исправлении, основываясь исключительно на статическом коде, этот специализированный режим использует многоэтапный диагностический рабочий процесс, в котором агент сначала генерирует потенциальные теории, а затем автоматически добавляет в ваш код временные операторы печати или логику логирования, чтобы наблюдать за поведением приложения в режиме реального времени. После запуска приложения и обнаружения ошибки агент зафиксирует полученные логи и состояния переменных, чтобы точно определить точку отказа, что позволит ему создать высокоточное, точечное исправление, а не проводить масштабный рефакторинг. После решения и проверки проблемы агент автоматически удалит все добавленные временные инструменты, гарантируя, что окончательный код останется чистым и готовым к использованию в производственной среде."
  },
  {
    "section": "Kodik Education",
    "text": "Мы активно работаем над разработкой образовательной версии Kodik и планируем выпустить её вместе с версией 2.0.0. Kodik Education — это эволюция IDE, ориентированная на обучение, созданная, чтобы сократить разрыв между «кодированием» и «пониманием» с помощью глубоко интегрированного сократовского движка ИИ. В отличие от рабочей версии, где приоритет — скорость, Scholar использует педагогическую систему контроля доступа: кнопка «Применить» превращается в «Логический мост», и прежде чем код будет зафиксирован, ИИ просит пользователя объяснить базовую идею или предсказать результат — так исключается слепое копирование решений. Среда снабжена визуализатором исполнения в реальном времени, который анимирует стек и кучу по ходу выполнения, делая абстрактные темы (например, арифметику указателей и замыкания) наглядными и понятными. Дополнительно платформа включает встроенный маркетплейс курсов — авторы и преподаватели могут публиковать и продавать курсы, а студенты — покупать материалы, проходить обучение и оставлять отзывы прямо внутри среды."
  },
  {
    "section": "Встроенный маркетплейс Kodik",
    "text": "Встроенный маркетплейс для Kodik — одна из идей, которая нас очень вдохновляет, и мы активно работаем над его внедрением для нашей аудитории вместе с версией 2.0.0. Kodik Marketplace — это единая платформа внутри среды Kodik, где пользователи могут не только учиться, но и делиться своими проектами и курсами. Здесь преподаватели и опытные разработчики могут публиковать образовательные курсы, учебные материалы и интерактивные проекты, делая их доступными для покупки другими пользователями. Маркетплейс поддерживает полноценную экономику обмена знаниями: студенты могут приобретать курсы и проекты, оставлять отзывы, оценивать материалы и следить за обновлениями авторов. Каждый проект, развернутый через Kodik Hosting, может быть выставлен на продажу или доступен для «форка» — пользователи могут создавать свои копии проектов, вносить изменения и, при желании, продавать их дальше. Система автоматически отслеживает лицензии и права на использование, обеспечивая безопасную и прозрачную среду для торговли и совместного обучения."
  },
  {
    "section": "Kodik Hosting",
    "text": "Встроенная платформа для хостинга, где наши пользователи смогут размещать свои проекты одним кликом прямо из Kodik, — это идея, которая нас очень вдохновляет, и мы активно работаем над её реализацией к версии 2.0.0. Kodik Hosting — это встроенная платформа для быстрого развертывания проектов прямо из среды Kodik. Пользователи могут создавать проекты и, с помощью одного клика, публиковать их в интернете без сложной настройки серверов или инфраструктуры. Kodik автоматически обрабатывает все этапы: сборку, настройку зависимостей, конфигурацию окружения и оптимизацию для производительности. Проекты становятся доступны по уникальной ссылке, которую можно сразу использовать для демонстрации, обмена с коллегами или добавления в портфолио. Система также поддерживает обновления в реальном времени: при изменении кода пользователю достаточно снова нажать «Deploy», чтобы новая версия проекта была мгновенно опубликована. Дополнительно, хостинг интегрирован с образовательными возможностями платформы: преподаватели могут создавать демонстрационные проекты для студентов, студенты — делиться своими решениями, а ИИ внутри среды анализирует развернутый проект и предлагает улучшения или комментарии."
  },
  {
    "section": "Когда будет выпущена версия 2.0.0?",
    "text": "У нас нет точной даты, которую мы могли бы сообщить, но мы можем рассказать о наборе целей, над которыми мы работаем, и которые позволят нам сказать, что версия 2.0.0 готова к выпуску. Не включая мелкие обновления и исправления, вот основные идеи, которыми мы хотели бы поделиться с нашими пользователями и над которыми мы работаем: 1. Система управления многоагентной средой Kodik — она переведет IDE с файлово-ориентированной структуры на среду, ориентированную на результат, где несколько агентов ИИ могут одновременно работать над независимыми или параллельными задачами. В основе этой системы лежит модель Composer, архитектура смешанных экспертов (MoE), специально обученная для разработки программного обеспечения. Чтобы предотвратить взаимное влияние этих агентов друг на друга или на активную работу пользователя, Kodik будет использовать Git Worktrees, которая создает изолированные копии кодовой базы для до восьми агентов, работающих параллельно. Это позволяет создавать мощные рабочие процессы, такие как подход «Лучший из N», когда один и тот же запрос отправляется нескольким моделям одновременно, чтобы вы могли сравнить их логику и применить наиболее эффективное решение, или многоаспектное выполнение задач, когда один агент рефакторит бэкенд-утилиту, а другой генерирует модульные тесты в фоновом режиме. Система также будет использовать специализированных субагентов для обработки ресурсоемких операций, таких как исследование кодовой базы, тестирование в браузере и анализ логов терминала, в отдельных контекстных окнах, предотвращая раздувание основного диалога или потерю фокуса. Помимо ручной оркестровки, API фоновых агентов Kodik позволит осуществлять программное управление, позволяя автономным агентам запускать друг друга через веб-хуки для обработки длительных асинхронных задач, таких как полная миграция стека. Вся эта экосистема управляется через новый многоагентный интерфейс, который отдает приоритет высокоуровневым планам и отслеживанию прогресса, а не редактированию отдельных файлов, фактически смещая роль разработчика с непосредственного программиста на менеджера задач, который проверяет и объединяет окончательные результаты работы ИИ. 2. Вторая функциональность — это визуальный редактор Kodik Browser, представляющий собой среду проектирования на основе ИИ, интегрированную непосредственно в IDE Kodik, которая устраняет разрыв между визуальным дизайном и производственным кодом, позволяя манипулировать элементами пользовательского интерфейса в работающем приложении и автоматически синхронизировать эти изменения с исходными файлами. Открыв локально запущенный проект во встроенном браузере Kodik и активировав режим проектирования, вы можете использовать функцию перетаскивания для изменения структуры DOM, визуальные ползунки и инструменты выбора для настройки свойств CSS, таких как типографика и отступы, или щелкать по определенным элементам, чтобы получить подсказки на естественном языке для выполнения ИИ. Для современных фреймворков, таких как React, редактор даже будет отображать свойства и состояния компонентов непосредственно в боковой панели, что позволит вам тестировать различные варианты пользовательского интерфейса без ручного кодирования. Как только вы будете удовлетворены этими визуальными настройками, нажатие кнопки «Применить» запустит агента ИИ для анализа изменений и перезаписи базовых файлов проекта, гарантируя соблюдение токенов дизайна и существующих системных ограничений. Хотя он будет оптимизирован скорее для доработки и улучшения существующих интерфейсов, чем для создания сложных систем с нуля, он послужит мощным инструментом для инженеров, устраняющим трение между стилизацией в браузере и фиксацией этих изменений в кодовой базе. 3. Режим Debug — в Kodik ИИ превратится из творческого помощника в детектива, работающего в режиме реального времени и отдающего приоритет эмпирическим данным, а не догадкам, для решения сложных программных ошибок. В отличие от стандартных чатов, которые выдвигают гипотезы об исправлении, основываясь исключительно на статическом коде, этот специализированный режим использует многоэтапный диагностический рабочий процесс, в котором агент сначала генерирует потенциальные теории, а затем автоматически добавляет в ваш код временные операторы печати или логику логирования, чтобы наблюдать за поведением приложения в режиме реального времени. После запуска приложения и обнаружения ошибки агент зафиксирует полученные логи и состояния переменных, чтобы точно определить точку отказа, что позволит ему создать высокоточное, точечное исправление, а не проводить масштабный рефакторинг. После решения и проверки проблемы агент автоматически удалит все добавленные временные инструменты, гарантируя, что окончательный код останется чистым и готовым к использованию в производственной среде. 4. Kodik Education — это эволюция IDE, ориентированная на обучение, созданная, чтобы сократить разрыв между «кодированием» и «пониманием» с помощью глубоко интегрированного сократовского движка ИИ. В отличие от рабочей версии, где приоритет — скорость, Scholar использует педагогическую систему контроля доступа: кнопка «Применить» превращается в «Логический мост», и прежде чем код будет зафиксирован, ИИ просит пользователя объяснить базовую идею или предсказать результат — так исключается слепое копирование решений. Среда снабжена визуализатором исполнения в реальном времени, который анимирует стек и кучу по ходу выполнения, делая абстрактные темы (например, арифметику указателей и замыкания) наглядными и понятными. Дополнительно платформа включает встроенный маркетплейс курсов — авторы и преподаватели могут публиковать и продавать курсы, а студенты — покупать материалы, проходить обучение и оставлять отзывы прямо внутри среды. 5. Kodik Marketplace — это единая платформа внутри среды Kodik, где пользователи могут не только учиться, но и делиться своими проектами и курсами. Здесь преподаватели и опытные разработчики могут публиковать образовательные курсы, учебные материалы и интерактивные проекты, делая их доступными для покупки другими пользователями. Маркетплейс поддерживает полноценную экономику обмена знаниями: студенты могут приобретать курсы и проекты, оставлять отзывы, оценивать материалы и следить за обновлениями авторов. Каждый проект, развернутый через Kodik Hosting, может быть выставлен на продажу или доступен для «форка» — пользователи могут создавать свои копии проектов, вносить изменения и, при желании, продавать их дальше. Система автоматически отслеживает лицензии и права на использование, обеспечивая безопасную и прозрачную среду для торговли и совместного обучения. Маркетплейс объединяет обучение, практику и реальный опыт создания и обмена проектами, превращая процесс освоения кодирования в полноценное сообщество авторов и студентов. 6. Kodik Hosting — это встроенная платформа для быстрого развертывания проектов прямо из среды Kodik. Пользователи могут создавать проекты и, с помощью одного клика, публиковать их в интернете без сложной настройки серверов или инфраструктуры. Kodik автоматически обрабатывает все этапы: сборку, настройку зависимостей, конфигурацию окружения и оптимизацию для производительности. Проекты становятся доступны по уникальной ссылке, которую можно сразу использовать для демонстрации, обмена с коллегами или добавления в портфолио. Система также поддерживает обновления в реальном времени: при изменении кода пользователю достаточно снова нажать «Deploy», чтобы новая версия проекта была мгновенно опубликована. Дополнительно, хостинг интегрирован с образовательными возможностями платформы: преподаватели могут создавать демонстрационные проекты для студентов, студенты — делиться своими решениями, а ИИ внутри среды анализирует развернутый проект и предлагает улучшения или комментарии, помогая закрепить полученные навыки на практике."
  },
  {
    "section": "Если что-то не работает",
    "text": "Если что-то не работает в Kodik, для нас важно исправить проблему как можно быстрее. Для этого нам нужно получить как можно больше информации о ситуации. Вот формат отчёта, который поможет нам лучше понять проблему: 1. Краткое описание проблемы. 2. Системная информация (Справка → О программе). 3. Ваша операционная система. 4. Пошаговые действия для воспроизведения проблемы. 5. Скриншоты чата или редактора. 6. Экспорт чата для проверки деталей. С этими данными мы сможем оказать более эффективную поддержку."
  },
  {
    "section": "Субагенты для ресурсоемких операций",
    "text": "Система многоагентности в Kodik 2.0.0 будет использовать специализированных субагентов для обработки ресурсоемких операций, таких как исследование кодовой базы, тестирование в браузере и анализ логов терминала, в отдельных контекстных окнах, предотвращая раздувание основного диалога или потерю фокуса. Помимо ручной оркестровки, API фоновых агентов Kodik позволит осуществлять программное управление, позволяя автономным агентам запускать друг друга через веб-хуки для обработки длительных асинхронных задач, таких как полная миграция стека."
  },
  {
    "section": "Многоагентный интерфейс",
    "text": "Вся экосистема многоагентной среды управляется через новый многоагентный интерфейс, который отдает приоритет высокоуровневым планам и отслеживанию прогресса, а не редактированию отдельных файлов, фактически смещая роль разработчика с непосредственного программиста на менеджера задач, который проверяет и объединяет окончательные результаты работы ИИ."
  },
  {
    "section": "Как экспортировать чат",
    "text": "Чтобы экспортировать чат, нужно перейти в раздел «История» в верхней части вкладки чата, навести курсор на сессию, которую вы хотите экспортировать, и нажать кнопку загрузки."
  },
  {
    "section": "Как изменить язык",
    "text": "Чтобы изменить язык в Kodik, можно перейти в настройки чата и выбрать нужный язык в общих настройках."
  },
  {
    "section": "Как проверить наличие новой версии",
    "text": "Чтобы проверить, доступна ли новая версия Kodik, вы можете посетить сайт https://vibekodik.ru/download и сравнить загруженную версию с вашей текущей, либо в Kodik нажать на значок настроек в левом нижнем углу и проверить обновления там."
  }

]
